app/views/leader_boards/index.html.erb

      <td><%= player.name %></td>
      <td><%= player.scores.count %></td>
      <%
        score_values = player.scores.map(&:value)
---
SELECT COUNT(*) FROM `scores` WHERE `scores`.`player_id` = 3
SELECT `scores`.`value` FROM `scores` WHERE `scores`.`player_id` = 3