app/views/games/_form.html.erb

        <%= s.label "player" %>
        <%= s.collection_select(:player_id, Player.all, :id, :name, { :prompt => 'Select Player'}) %>
---
SELECT `players`.* FROM `players`