app/controllers/games_controller.rb

SELECT `games`.* FROM `games`
---
  def index
    @games = Game.all

INSERT INTO `games` (`name`, `place`, `start_date`, `end_date`, `created_at`, `updated_at`) VALUES ('Demo game', 'bbsr', '2021-04-23', '2021-04-23', '2021-04-23 12:42:41', '2021-04-23 12:42:41')
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

UPDATE `games` SET `place` = 'bbsr', `updated_at` = '2021-04-23 10:56:39' WHERE `games`.`id` = 1
---
  def update
    respond_to do |format|
      if @game.update(game_params)

DELETE FROM `games` WHERE `games`.`id` = 1
---
  def destroy
    @game.destroy

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
---
    def set_game
      @game = Game.find(params[:id])