app/controllers/leader_boards_controller.rb

SELECT  DISTINCT `players`.`id`, scores.value AS alias_0 FROM `players` LEFT OUTER JOIN `scores` ON `scores`.`player_id` = `players`.`id` WHERE `players`.`id` IN (SELECT `players`.`id` FROM `players` INNER JOIN `scores` ON `scores`.`player_id` = `players`.`id` GROUP BY players.id HAVING count(scores.id)>=10)  ORDER BY scores.value desc LIMIT 10
SELECT COUNT(*) FROM `scores` WHERE `scores`.`player_id` = 3
SELECT `scores`.`value` FROM `scores` WHERE `scores`.`player_id` = 3
---
  def index
  	@players = Player.includes(:scores)
                .group('players.id')
                .having("count(scores.id)>=10")
                .order("scores.value desc").limit(10)