app/controllers/players_controller.rb

SELECT `players`.* FROM `players`
---
  def index
    @players = Player.all

INSERT INTO `players` (`name`, `contact_number`, `email`, `joining_date`, `created_at`, `updated_at`) VALUES ('jyoti prakash mohapatra', '09658592488', 'jyotiprakashmohapatra9@gmail.com', '2021-04-23', '2021-04-23 05:14:31', '2021-04-23 05:14:31')
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save

DELETE FROM `players` WHERE `players`.`id` = 1
---
  def destroy
    @player.destroy

SELECT  `players`.* FROM `players` WHERE `players`.`id` = 3 LIMIT 1
---
    def set_player
      @player = Player.find(params[:id])